
var favorNoObj = {
	selPattern : ""
	, captchaConfirmYn : ""
	, selPatternNo : ""
	, patternNoList : null
	, favorNoList : null
	, selFavorNo : ""
	, patternNoListPageOption : {
		maxPage : 1
		, maxBlock : 1
		, curPage : 1
		, curBlock : 1
		, selPatternNopage : 1
		, selPatternNo : 1
		, listCountPerPage : 10
		, pageNaviBlock : 5
		, objList : "patternNoList"
	}
	, favorNoListPageOption : {
		maxPage : 1
		, maxBlock : 1
		, curPage : 1
		, curBlock : 1
		, selPatternNopage : 1
		, selPatternNo : 1
		, listCountPerPage : 12
		, pageNaviBlock : 5
		, objList : "favorNoList"
	}
};

var arrTest = {
	name : "arrTest"
	, data1 : [
		{seq:0
		,arr:[
			 0,1,2,3,4,5,6,7,8,9
			,1,1,2,3,4,5,6,7,8,9
			,2,1,2,3,4,5,6,7,8,9
			,3,1,2,3,4,5,6,7,8,9
			,4,1,2,3,4,5,6,7,8,9
			,5,1,2,3,4,5,6,7,8,9
			,6,1,2,3,4,5,6,7,8,9
			,7,1,2,3,4,5,6,7,8,9
			,8,1,2,3,4,5,6,7,8,9
			,9,1,2,3,4,5,6,7,8,9
			]
		}
	]
	, data2 : [
			 0,1,2,3,4,5,6,7,8,9
			,1,1,2,3,4,5,6,7,8,9
			,2,1,2,3,4,5,6,7,8,9
			,3,1,2,3,4,5,6,7,8,9
			,4,1,2,3,4,5,6,7,8,9
			,5,1,2,3,4,5,6,7,8,9
			,6,1,2,3,4,5,6,7,8,9
			,7,1,2,3,4,5,6,7,8,9
			,8,1,2,3,4,5,6,7,8,9
			,9,1,2,3,4,5,6,7,8,9
	]
};

var lottoObj = {
	selSeq : ""
	, viewLimitCount : 30
	, selPos : ""
	, selNo : ""
	, arrColor45	: [{seq:0,color:""}]
	, arrColor15	: [{seq:0,color:""}]
	, arrColor10	: [{seq:0,color:""}]
	, arrColor09	: [{seq:0,color:""}]
	, arrColor05	: [{seq:0,color:""}]
	, arrColor03	: [{seq:0,color:""}]
	, arrFreq		: [{seq:0,arr:[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}	]
	, arrFreqSum	: [{seq:0,arr:[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}	]
	, arr45G		: [{seq:0,arr:[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}	]
	, arr45G		: [{seq:0,arr:[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}	]
	, arr45GFreq	: [{seq:0,arr:[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]}	]
	, arr15G		: [{seq:0,arr:[0, 1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ,10,11,12,13,14 ]} ]		//// 15Group 데이타 생성 
	, arr10G		: [{seq:0,arr:[0, 1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ]} ]		//// 10단위(1~9, 10~19, 20~29 데이타 생성 
	, arr09G		: [{seq:0,arr:[0, 1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ]}					 ]		//// 9Group 데이타 생성 
	, arr05G		: [{seq:0,arr:[0, 1 ,2 ,3 ,4 ]}							 ]			//// 5Group 데이타 생성 
	, arr03G		: [{seq:0,arr:[0, 1 ,2 ]}									 ]	//// 3Group 데이타 생성 
	, arr15D		: [{seq:0,arr:[0, 1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ,10,11,12,13,14 ]} ]		//// 15나누기 나머지 데이타 생성
	, arr10D		: [{seq:0,arr:[0, 1 ,2 ,3 ,4 ,5 ,6 ,7 ,8, 9 ]}					 ]		//// 10나누기 나머지 데이타 생성
	, arr09D		: [{seq:0,arr:[0, 1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ]}					 ]		//// 9나누기 나머지 데이타 생성
	, arr05D		: [{seq:0,arr:[0, 1 ,2 ,3 ,4 ]}							 ]			//// 5나누기 나머지 데이타 생성
	, arr03D		: [{seq:0,arr:[0, 1 ,2 ]}									 ]		//// 3나누기 나머지 데이타 생성
	, arr45			: [0 ,1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45 ]
	, arrPerd : null
	, arrReAppear	: [{seq:0,arr:[0,0,0,0,0,0]}									 ]		//// 3나누기 나머지 데이타 생성
};
